{
  "main": {
    "name": "Shalin Patel",
    "description": "Enthusiastic Computer Science student with lots of passion and experience in the Software Engineering realm. Excellent programming skills in multiple languages and a strong background in how to work as a team with admirable communication skills.",
    "image": "profilepic.jpg",
    "bio": "~Winston Churchill",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "Patel.Shalin@outlook.com",
    "website": "www.shalin-patel.com",
    "resumedownload": "/Shalin-Patel-Resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/shalin1patel/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/PatelShalin",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "University of Waterloo",
        "degree": "Honours Bachelors of Computer Science",
        "graduated": "September 2018 - April 2023",
        "description1": "Dean's List - Winter 2020",
        "description2": "President's Scholarship of Distinction"
      }
    ],
    "work": [
      {
        "company": "Coalition, Inc.",
        "title": "Software Engineer - Backend",
        "years": "February 2024 - Present",
        "description1": "• Developed the schedule a bind feature by writing endpoints in Python and Temporal workflows in Go, scheduling over 220 quotes to be bound resulting in a 15% reduction in the bind system's p95 latency.",
        "description2": "• Led the renewals Canadian expansion implementing gRPC endpoints in Go and workflows in Temporal to ensure compliance with regional regulations, resulting in $2.9mm gross written premium."
      },
      {
        "company": "Astronomer",
        "title": "Software Engineer - Control Plane",
        "years": "May 2023 - January 2024",
        "description1": "• Launched trial-based on-boarding to serve 110 new clients by building new Go endpoints, modifying relevant front-end components in React, and integrating with Datadog to track incoming requests.",
        "description2": "• Refactored the billing architecture using Airflow and Azure Blob Storage to introduce fault tolerance, data reconciliation, and retryable DAGs reducing invoice generation errors by 20%.",
        "description3": "• Worked with Microsoft to integrate Astronomer as an Azure Native ISV service within the Azure Marketplace, involving the development of custom endpoints in Go and a custom usage-based billing workflow, generating $230k in top-line revenue."
      },
      {
        "company": "AWS - Managed Workflows for Apache Airflow",
        "title": "Software Development Engineering Intern",
        "years": "May - August 2022",
        "description1": "• Implemented a log parser in CloudWatch reducing customer tickets by 10%, targeting failed tasks in Airflow.",
        "description2": "• Designed a system to ingest data across MWAA Environments into a Data Warehouse using AWS Redshift."
      },
      {
        "company": "Squarepoint Capital",
        "title": "Software Engineering Intern",
        "years": "January - April 2022",
        "description1": "• Wrote ETL pipelines in Python and deployed using Nomad to support 13+ quantitative trading strategies.",
        "description2": "• Designed an asynchronous search platform to support regex searching of 100k+ documents."
      },
      {
        "company": "Pronti AI",
        "title": "Software Engineer",
        "years": "January 2021 - December 2021",
        "description1": "• Led the development of a flagship Android application with 1M+ downloads and 41k monthly active users."
      },
      {
        "company": "PagerDuty",
        "title": "Software Engineering Intern",
        "years": "May - August 2021",
        "description1": "• Customized dashboards in Sisense to track retention rate and crash rate for 7 screens, which were reviewed at weekly operations meetings and led to the discovery of 8 actionable tickets.",
        "description2": "• Developed maintenance window feature on Android application using Java and Kotlin, collaborating with a cross-functional team comprised of designers, product managers, and engineers."
      },
      {
        "company": "Doppl",
        "title": "Software Development Intern",
        "years": "May - August 2020",
        "description1": "• Implemented a route optimization algorithm in C++ similar to the Travelling Salesman Problem, achieving O(nlog(n)) runtime for the average client use case.",
        "description2": "• Created a full-stack proof-of-concept using React Native, Apollo GraphQL, and Golang that successfully led to full development.",
        "description3": "• Contributed to client front-end dashboard using React, Mapbox and tested using Jest.",
        "description4": "• Developed critical in-production admin dashboard using React, Node, Express, and MongoDB."
      },
      {
        "company": "Ontario MGCS",
        "title": "Infrastructure Technologies Services Co-op",
        "years": "May - August 2019",
        "description1": "• Worked with IBM's Privileged Identity Manager to handle access management for the secure data servers at the Data Center Operations sector in MGCS.",
        "description2": "• Optimized SQL queries in SSMS sent through PowerBI reports improving time taken by 54%."
      }
    ],
    "project": [
      {
        "company": "Moodify",
        "title": "Python | text2emotion | SpotifyAPI | TwitterAPI",
        "description1": "• A python bot which tweets a generated spotify playlist based on the emotions captured from a tagged tweet using text2emotion.",
        "description2": "• Won Best Machine Learning Hack at Hacklytics 2021."
      },
      {
        "company": "Solar Power Generators",
        "title": "Python | Pandas | MatPlotLib | Scikit-Learn",
        "description1": "• Program that successfully predicts power generation and irradiation of solar panels with an 88% accuracy.",
        "description2": "• Cleaned data using pandas, detecting for missing values and replacing them with their respective means.",
        "description3": "• Performed EDA using MatPlotLib to graph the data, identify trends and form initial hypotheses.",
        "description4": "• Implemented DecisionTree and XGBoost Regressor models using Scikit-Learn to validate hypotheses."
      },
      {
        "company": "Identity Manager",
        "title": "MongoDB | Express.js | React.js | Node.js | JavaScript | HTML5 | CSS3",
        "description1": "• A full stack MERN web application with a Material UI appearance.",
        "description2": "• It allows the user to register/login and store their multiple online credentials and safely logout.",
        "description3": "• Incorporated CRUD functionality, the use of React hooks, context and JWT authentication."
      },
      {
        "company": "Astro",
        "title": "Django | Python | JavaScript | HTML5 | CSS3",
        "description1": "• Innovated a Facebook-type application directed towards youth with a space-theme.",
        "description2": "• Focused on making an elegant, user-friendly interface by using Django for CRUD functionality.",
        "description3": "• Uploaded on pythonanywhere.com, capturing a web traffic of 674 within the first two months."
      }
    ],
    "skills": [
      {
        "name": "Python, C, C++, JavaScript, ReactJs, Java, SQL, Bash, Git",
        "level": "90%"
      },
      {
        "name": "",
        "level": "70%"
      },
      {
        "name": "MongoDB, Express.js, Node.js, Django,",
        "level": "60%"
      }
    ]
  }
}
